src/Documents/УстановкаЦенНапитков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЦенНапитков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНапитков</xr:Item>
				<xr:Item>InformationRegister.ПоказанияСчетчиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоматы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Напиток</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Напитки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЦеныНапитков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНапитков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоматы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Напиток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Напитки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/УстановкаЦенНапитков/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ЦеныНапитков.Записывать = Истина;

	Для Каждого Строка Из Цены Цикл

		Запись = Движения.ЦеныНапитков.Добавить();
		Запись.Период  = Дата;
		Запись.Автомат = Строка.Автомат;
		Запись.Напиток = Строка.Напиток;
		Запись.Цена    = Строка.Цена;

	КонецЦикла;

КонецПроцедуры
